/**
*? Напишіть код, який запитуватиме
*? логін за допомогою prompt та логувати результат
*? у консоль браузера
    
*? Якщо відвідувач вводить "Адмін",
*? то prompt запитує пароль.
*? Якщо нічого не ввели або натиснуто клавішу Esc
*? вивести рядок "Скасовано"
*? В іншому випадку вивести рядок "Я вас не знаю"
    
*? Пароль перевіряти так:
*? Якщо введено пароль "Я головний",
*? то вивести рядок "Здрастуйте!"
*? інакше виводити рядок "Невірний пароль!"
  */

const userName = prompt("Введіть логін");

if (userName === "Адмін") {
  const userPass = prompt("Введіть пароль");
  console.log(userPass);

  if (!userPass) {
    console.log(userPass, "Скасовано");
  } else {
    if (userPass === "Я головний") {
      console.log("Здрастуйте!");
    } else {
      console.log("Невірний пароль!");
    }
  }
} else {
  console.log("Я вас не знаю");
}
